Revit 2025 API
ImportExportFileFormat Enumeration
 Describes formats supported by import / export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ImportExportFileFormat
Public Enumeration ImportExportFileFormat
public enum class ImportExportFileFormat
type ImportExportFileFormat
Members
Member name | Value | Description
DWG | 1 |  DWG format
DWF | 2 |  DWF format
DWFX | 4 |  DWFX format
GBXML | 6 |  GBXML format
FBX | 7 |  FBX format
Image | 8 |  Image format
DGN | 9 |  DGN format
Civil3D | 10 |  Civil3D format. Obsolete.
Inventor | 11 |  Inventor format
DXF | 12 |  DXF format
SAT | 13 |  SAT format
IFC | 14 |  IFC format
NWC | 15 |  Navisworks format
PDF | 16 |  PDF format
STL | 17 |  STL format
AXM | 19 |  AXM format
OBJ | 20 |  OBJ format
STEP | 23 |  STEP format
See Also
Reference
Autodesk.Revit.DB Namespace